//
//  News.swift
//  VK
//
//  Created by Илья on 07/09/2019.
//  Copyright © 2019 Ilya Sazonenkov. All rights reserved.
//

import UIKit


struct News {
    var titleNews: String
    var textNews: String
    var fotoNews: UIImage?
}

let news1 = News(titleNews: "Самые красивые закаты на Бали", textNews: "Индонезийский остров Бали – место потрясающих и неповторимых закатов над Индийским океаном. Местные жители и путешественники каждый день собираются в разных частях острова, чтобы увидеть, как солнце скрывается за горизонтом и погружается в океан. Люди специально отправляются в самые живописные места острова, чтобы насладиться этим зрелищным моментом.", fotoNews: UIImage(named: "news1"))

let news2 = News(titleNews: "Фильм «Мстители: Финал» побьет десятилетний рекорд «Аватара» по сборам", textNews: "Американский супергеройский фильм «Мстители: Финал» установит новый мировой рекорд кассовых сборов. Это позволит картине обойти научно-фантастическую ленту «Аватара», которая оставалась на первом месте в течение десяти последних лет. Об этом пишет Hollywood Reporter со ссылкой на данные компании The Walt Disney Company.", fotoNews: UIImage(named: "news2"))

let news3 = News(titleNews: "Математическая модель раскрывает секреты зрения.", textNews: "Математики и нейробиологи создали первую анатомически точную модель, которая объясняет, как возможно зрение.", fotoNews: UIImage(named: "news3"))

let news4 = News(titleNews: "Десерты — это сладкая «точка» любого застолья.", textNews: "Интересно, что первые конфеты с сахаром появились только в шестнадцатом веке в Италии. Но продавали их только в аптеках, потому что считались сильнейшим лекарством. Назначались они, как правило, только взрослым.", fotoNews: UIImage(named: "news4"))

let news5 = News(titleNews: "Российские социологи провели первый в мире соцопрос чат-ботов", textNews: "Опрос проводили социологи из Центра социального проектирования «Платформа», приурочив его к запуску 22 августа человекообразного робота от «Роскосмоса» Skybot F-850 (FEDOR) с космодрома «Байконур».\nРазговор с каждым роботом занял не менее 45 минут...\nМы привыкли воспринимать чат-ботов как сугубо сервисные и технические.\nПо мнению экспертов, через 5-10 лет речевые навыки чат-ботов будут практические неотличимы от человеческих. С учетом того, что общение между людьми становится все более виртуальным.", fotoNews: UIImage(named: "news5"))

var allMyNews = [ news1, news2, news3, news4, news5 ]
